{"id":14868,"date":"2017-11-08T19:12:19","date_gmt":"2017-11-08T19:12:19","guid":{"rendered":"https:\/\/pur.vamtam.com\/?page_id=14868"},"modified":"2021-07-06T15:29:22","modified_gmt":"2021-07-06T15:29:22","slug":"spa-etiquette","status":"publish","type":"page","link":"https:\/\/pur.vamtam.com\/our-spa\/spa-etiquette\/","title":{"rendered":"Spa Etiquette"},"content":{"rendered":"<div class=\"vgblk-rw-wrapper limit-wrapper\">\n<h3>\n\tHealth Concerns\n\t<\/h3>\n\t<p>Please advise the Spa when making your booking if you are pregnant or breastfeeding, if you suffer from any medical conditions, injuries and allergies or if you have any special requests as some treatments may not be safe or suitable to be carried out.<\/p>\n<h3>\n\tReservations &amp; Cancellations\n\t<\/h3>\n\t<p>We recommend booking in advance. Credit card details are required to make and confirm any booking.<\/p>\n<p>Please be aware that cancellations must be made 24 hours prior to the treatment, otherwise a full cancellation fee will be charged. We regret that it may be necessary to treat appointments as cancelled, for clients arriving more than 15 minutes late.<\/p>\n<p>We kindly ask that you turn your mobile phone to silent mode when you arrive to allow you and our other guests to relax.<\/p>\n<h3>\n\tSpa Etiquette\n\t<\/h3>\n\t<p>We recommend that you arrive a few minutes before your spa appointment so you have time to check in, fill out our consultation card and unwind. The use of the steam room or Jacuzzi is recommended prior to a spa booking as it helps you to relax. If you wish to arrive early, we suggest you arrive 40 minutes prior to your appointment. There is a charge for using these facilities.<\/p>\n<h3>\n\tChildren\n\t<\/h3>\n\t<p>Children under the age of 16 may have treatments as long as they are accompanied by adult who has signed a consent form. If the child is between 16 and 18 years of age, they can have treatments without an adult, but the adult must sign a consent form. All junior treatments must to be approved by the Spa Manager.<\/p>\n<p>If you are uncomfortable with anything during your treatment (e.g. the pressure, the music or the temperature) please feel free to let your therapist know as they will be more than happy to make any necessary adjustments.<\/p>\n<h3>\n\tSpa Attire\n\t<\/h3>\n\t<p>When arriving at the spa you may change into a robe and slippers in our changing rooms or you may go straight to your treatment room as you are. Please feel free to wear whatever makes you comfortable. You may be asked to remove certain clothing but the most important thing is that you are comfortable. Our therapists will keep your body draped in towels and only expose each area being treated. In wet treatments such as body scrubs and body wraps, you will not always be draped. Swimsuits are optional in these treatments and we have disposable underwear if you prefer.<\/p>\n\n<\/div><!-- .vgblk-rw-wrapper -->","protected":false},"excerpt":{"rendered":"<p>Health Concerns Please advise the Spa when making your booking if you are pregnant or breastfeeding, if you suffer from any medical conditions, injuries and allergies or if you have any special requests as some treatments may not be safe or suitable to be carried out. Reservations &amp; Cancellations We recommend booking in advance. Credit&#8230;<\/p>\n","protected":false},"author":2,"featured_media":0,"parent":14847,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_price":"","_stock":"","_tribe_ticket_header":"","_tribe_default_ticket_provider":"","_tribe_ticket_capacity":"0","_ticket_start_date":"","_ticket_end_date":"","_tribe_ticket_show_description":"","_tribe_ticket_show_not_going":false,"_tribe_ticket_use_global_stock":"","_tribe_ticket_global_stock_level":"","_global_stock_mode":"","_global_stock_cap":"","_tribe_rsvp_for_event":"","_tribe_ticket_going_count":"","_tribe_ticket_not_going_count":"","_tribe_tickets_list":[],"_tribe_ticket_has_attendee_info_fields":false},"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/pages\/14868"}],"collection":[{"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/comments?post=14868"}],"version-history":[{"count":16,"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/pages\/14868\/revisions"}],"predecessor-version":[{"id":17450,"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/pages\/14868\/revisions\/17450"}],"up":[{"embeddable":true,"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/pages\/14847"}],"wp:attachment":[{"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/media?parent=14868"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}