{"id":14872,"date":"2017-11-08T19:12:52","date_gmt":"2017-11-08T19:12:52","guid":{"rendered":"https:\/\/pur.vamtam.com\/?page_id=14872"},"modified":"2019-02-20T18:37:31","modified_gmt":"2019-02-20T18:37:31","slug":"faq","status":"publish","type":"page","link":"https:\/\/pur.vamtam.com\/our-spa\/faq\/","title":{"rendered":"FAQ"},"content":{"rendered":"<div class=\"vgblk-rw-wrapper limit-wrapper\">\n\t\t\tHow do I get to the Spa?\n\t\t<p>Spa is located in New York, USA, Firs Avenue, Muswell Hill.<\/p>\n\t\t\tHow much does it cost to get a spa therapy?\n\t\t<p>Prices very greatly depending on witch treatment do you need to, , the best way to obtain an estimate is to either contact the specialist directly or come to the Spa.<\/p>\n\t\t\tCan I speak by telephone during the treatments?\n\t\t<p>Cell phones and other electronic devices need to be silenced while in the spa, and please no telephone conversations inside.<\/p>\n\t\t\tHow old do I have to be for spa treatments?\n\t\t<p>To ensure the ultimate experience for yourself and other guests, please refrain from bringing children.<\/p>\n\t\t\tAre walk-ins welcome?\n\t\t<p>Yes, walk ins are welcome and will be addressed on a first come first serve basis.<\/p>\n\t\t\tCan I pay with cash?\n\t\t<p>We accept cash, checks, Visa, Mastercard, Discover, American Express and our Gift Certificates. Payment is due in full at time of service. We do honor some third-party gift certificates including Spa Finder, Spa Wellness, and Yelp. A credit card or gift card will be required when scheduling your salon and spa services. Gratuities are at your discretion and are graciously accepted by our talented team of professionals.<\/p>\n\t\t\tIs there any refund policy if I am not satisfied?\n\t\t<p>We offer 100% satisfaction guarantee on all our products. If you decide that a product is not right for you, you may return the un-used portion within 10 days of original purchase to exchange for another product. No cash or credit card refunds, exchanges only.<\/p>\n\t\t\tWhat do I do if I need to cancel an appointment?\n\t\t<p>In order to cancel or reschedule an appointment you must call the Spa during business hours (noon-8pm) or contact your artist directly. Please note that all messages left after 8PM will not be checked until the following day. All deposits are non-refundable.<\/p>\n\t\t\tDo I need prior consultation?\n\t\t<p>Prior to each service your service provider will work with you through an in-depth consultation. At this time, they will assess your hair, skin, nails and body needs to determine the best possible treatments and products to use during your salon and spa experience. They will make product recommendations to help you maintain your look and feel.<\/p>\n\t\t\tHow do I book an appointment with Janet Williams?\n\t\t<p>Janet is not currently taking appointments.<\/p>\n\t\t\tCan I lunch in Spa?\n\t\t<p>Our lunches are catered especially for you. Upon your arrival, you will be given a menu to select your lunch preference. Lunches can include salad, sandwich, vegetarian and vegan options along with sides, chips, cookie and drink. A Spa Lunch may be added to any extended spa visit for $15 per perso<\/p>\n<h2>\n\tBook\n\t<\/h2>\n<h1>\n\tYour Treatment\n\t<\/h1>\n\tTalking body, listening hands.\n\n    Notice: JavaScript is required for this content.\n        <!-- TODO: Move to Template File. -->\n        <\/div><!-- .vgblk-rw-wrapper -->","protected":false},"excerpt":{"rendered":"<p>How do I get to the Spa? Spa is located in New York, USA, Firs Avenue, Muswell Hill. How much does it cost to get a spa therapy? Prices very greatly depending on witch treatment do you need to, , the best way to obtain an estimate is to either contact the specialist directly or&#8230;<\/p>\n","protected":false},"author":2,"featured_media":0,"parent":14847,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_price":"","_stock":"","_tribe_ticket_header":"","_tribe_default_ticket_provider":"","_tribe_ticket_capacity":"0","_ticket_start_date":"","_ticket_end_date":"","_tribe_ticket_show_description":"","_tribe_ticket_show_not_going":false,"_tribe_ticket_use_global_stock":"","_tribe_ticket_global_stock_level":"","_global_stock_mode":"","_global_stock_cap":"","_tribe_rsvp_for_event":"","_tribe_ticket_going_count":"","_tribe_ticket_not_going_count":"","_tribe_tickets_list":[],"_tribe_ticket_has_attendee_info_fields":false},"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/pages\/14872"}],"collection":[{"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/comments?post=14872"}],"version-history":[{"count":7,"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/pages\/14872\/revisions"}],"predecessor-version":[{"id":16813,"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/pages\/14872\/revisions\/16813"}],"up":[{"embeddable":true,"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/pages\/14847"}],"wp:attachment":[{"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/media?parent=14872"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}