{"id":12448,"date":"2010-04-28T15:22:46","date_gmt":"2010-04-28T15:22:46","guid":{"rendered":"https:\/\/pur.vamtam.com\/?p=12448"},"modified":"2019-02-20T18:37:36","modified_gmt":"2019-02-20T18:37:36","slug":"award-winning-entrepreneur-jen-groover-to-speak-at-women-in-wellness-leadership-conference","status":"publish","type":"post","link":"https:\/\/pur.vamtam.com\/award-winning-entrepreneur-jen-groover-to-speak-at-women-in-wellness-leadership-conference\/","title":{"rendered":"Award-Winning Entrepreneur Jen Groover to Speak at Women in Wellness Leadership Conference"},"content":{"rendered":"<div class=\"vgblk-rw-wrapper limit-wrapper\">\t<p>This is an aside post.<\/p>\r\n<p>Awarded by numerous publications and organizations for her innovative entrepreneurial skills, Jen Groover will share her expertise on March 6 at the American Spa&#8217;s Women in Wellness Leadership Conference with a session on &#8220;Building a Brand with Impact and Influence.&#8221; From yet-to-be realized personal passion projects to enhancing the impact of your current efforts, she will reveal best practices for innovation, evolution, and entrepreneurship. Groover is the founder of the multi-million-dollar Butler Bag brand, the world&#8217;s first compartmentalized handbag, and multiple other lifestyle brands, such as Empowered by Jen Groover, and entrepreneurial empowerment efforts, such as Leader Girlz, which teaches young girls the importance of empowerment through play. Groover was tagged by Success Magazine as a &#8220;One-Woman Brand,&#8221; a &#8220;Creativity and Innovation Guru,&#8221; and by Entrepreneur magazine as a leading &#8220;Serial Entrepreneur.&#8221; She was recently nominated as a UN delegate to the first-ever Global Accelerator for the Global Entrepreneurs Council. And she made history at the New York Stock Exchange as a member of the first all-female group to ring the opening bell. <\/p>\r\n<p>This fall, Groover is relaunching her best-selling What If? &amp; Why Not?, with updated resources; Optimized Potential; and #Empowered, which is based on her one-hour PBS special. A top business and lifestyle contributor and content creator for major television networks such as ABC, CBS, CNBC, NBC, Fox News, and more, Groover has also contributed to a host of publications and online resources including The Huffington Post, Entrepreneur magazine, and HealthyStyle NY. <\/p>\r\n<p>The success and momentum of Groover&#8217;s empowerment movement led her to launch the Empowered Economy Initiative, which encourages corporations and universities to combine efforts in order to educate and support small business owners and entrepreneurs in their communities, thereby stimulating the economy. She is also an advisor and partner for a new company called Thuzio, started by Tiki Barber and Mark Gerson, which is an innovative business model blending sports management and sports entertainment. <\/p>\r\n<p>Most recently, Groover launched an innovative economic and innovation movement for entrepreneurs and small business owners called Jumpstart StartUp, a first of its kind pop-up shop that launched in Philadelphia in October 2016 and is currently expanding to 10 cities nationwide. The groundbreaking venture features a curated matchmaking conversion of business experts, global brands, and entrepreneurs, creating an inspired experience to support small business growth and accelerate brands. <\/p>\r\n<\/div><!-- .vgblk-rw-wrapper -->","protected":false},"excerpt":{"rendered":"<p>Louis J. Erickson co-founded the company with me in 2000. We each own 50% of the company. I am the Chief Executive Officer and he is the Chief Operations Officer. Louis and I have been best friends for over 30 years. <\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"aside","meta":{"_price":"","_stock":"","_tribe_ticket_header":"","_tribe_default_ticket_provider":"","_tribe_ticket_capacity":"0","_ticket_start_date":"","_ticket_end_date":"","_tribe_ticket_show_description":"","_tribe_ticket_show_not_going":false,"_tribe_ticket_use_global_stock":"","_tribe_ticket_global_stock_level":"","_global_stock_mode":"","_global_stock_cap":"","_tribe_rsvp_for_event":"","_tribe_ticket_going_count":"","_tribe_ticket_not_going_count":"","_tribe_tickets_list":[],"_tribe_ticket_has_attendee_info_fields":false},"categories":[17],"tags":[557,531],"jetpack_featured_media_url":"","jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/posts\/12448"}],"collection":[{"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/comments?post=12448"}],"version-history":[{"count":8,"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/posts\/12448\/revisions"}],"predecessor-version":[{"id":16915,"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/posts\/12448\/revisions\/16915"}],"wp:attachment":[{"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/media?parent=12448"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/categories?post=12448"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/tags?post=12448"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}