{"id":6748,"date":"2014-09-01T16:39:51","date_gmt":"2014-09-01T16:39:51","guid":{"rendered":"https:\/\/pur.vamtam.com\/?p=6748"},"modified":"2019-02-20T18:37:35","modified_gmt":"2019-02-20T18:37:35","slug":"3-indian-ocean-islands-for-winter-sun","status":"publish","type":"post","link":"https:\/\/pur.vamtam.com\/3-indian-ocean-islands-for-winter-sun\/","title":{"rendered":"3 Indian ocean islands for winter sun"},"content":{"rendered":"<div class=\"vgblk-rw-wrapper limit-wrapper\"><h2>\r\n\tMauritius\r\n\t\t\t\r\n\t\t\t.fl-node- h2.vamtam-heading * {\r\n\t\t\t\tcolor: #ffa28a !important;\r\n\t\t\t\t\t\t\t}\r\n\t\t\r\n\t<\/h2>\r\n\t<p>With its sugar-cane plantations, Hindu temples, coral reefs and searing Creole cooking, Mauritius is a thrillingly exotic winter hop.<\/p>\r\n\t<p>The three-hour time-difference and an overnight flight means minimal jet lag too. No wonder everyone goes so crazy for it. LUX* Le Morne comes with a correspondingly loyal following: guests who return year after year to tap into its chilled out, kick-back vibe. The hotel happens to be on one of the best spots on the island, a UNESCO site. The Le Morne Peninsula is quiet and protected and its long swathe of icing-sugar-soft white sand is framed by the dramatic peak of Le Morne mountain. While there are masses of activities available, your daily routine can just involve mooching from four-poster bed to sun bed, watching kite surfers take advantage of the warm breeze. The joy for repeat visitors is that there are all sorts of surprises being added by the LUX* team, who entertain guests with delightful pop-up treats. Trays of unexpected canapés appear just as you&#8217;re feeling peckish. And there&#8217;s a wandering Aperitivo Bar, so you can help yourself to signature cocktails devised by the in-house mixologists.<\/p>\r\n<p>If you are an early riser, the LUX* Belle Mare on Mauritius&#8217;s East Coast is the perfect spot to see the sunrise. On your way to the beach pick up a double-shot almond flat white from the cute-as-pie Café LUX* (where the beans are roasted on site and the baristas don&#8217;t blink at a complicated order). LUX* design guru Kelly Hoppen transformed the property a few years ago with her sleek styling and modern edge. It feels fresh and funky but, at the same time, authentic with a strong sense of place. Hoppen is continuing to strike that clever balance over at LUX* Grand Gaube, which flings open its new-look doors at the beginning of December. The style is ultra-stylish and contemporary &#8211; bleached woods, patterned tiles, pops of yellows and charcoal greys &#8211; and alongside the hotel bedrooms are three private villas, each complemented with its own swimming pool and one with its very own beach. Guests staying here will be tempted out by Turkish treats at Bodrum Blue or to the Peruvian-Argentinian INTI restaurant, which promises Latin American passion along with refined Asian flair and a bar that will have you up all night, with some seriously good Pisco Sours. Here&#8217;s a hotel with a global groove.<\/p>\r\n<h2>\r\n\tLa Réunion\r\n\t\t\t\r\n\t\t\t.fl-node- h2.vamtam-heading * {\r\n\t\t\t\tcolor: #ffa28a !important;\r\n\t\t\t\t\t\t\t}\r\n\t\t\r\n\t<\/h2>\r\n\t<p>Way off the beaten track, a stay at LUX* Saint Gilles on the volcanic island of Réunion is how to secure the ultimate dinner-party bragging rights.<\/p>\r\n\t<p>Getting here is not actually so complicated after all (Heathrow, via Paris) and with year-round, soul-soothing heat and gentle trade winds, it&#8217;s well worth the journey. There&#8217;s so much to do: swim in waterfalls, whizz off in a helicopter over the volcano or paddle transparent kayaks out on the lagoon, where you might be lucky enough to spot whales breaching. But you can also fly and flop under the shade of a palm tree. The beach is peachy pristine, the yoga is complimentary, and if you spot a corked bottle bobbing in the surf or the pool, it might just have a note inside offering a free in-room massage. One day ice-lollies will be delivered poolside, the next you might find fresh coconuts with straws poking out the top. The hotel regularly thrills guests with its impromptu treats. And you can phone home from the red telephone box offering &#8216;on the house&#8217; calls to tell all your friends about it.<\/p>\r\n<h2>\r\n\tThe Maldives\r\n\t\t\t\r\n\t\t\t.fl-node- h2.vamtam-heading * {\r\n\t\t\t\tcolor: #ffa28a !important;\r\n\t\t\t\t\t\t\t}\r\n\t\t\r\n\t<\/h2>\r\n\t<p>Heading out to this incredible archipelago is like going on holiday in a postcard. And the LUX* South Ari Atoll continues that feeling of &#8216;can this be real?<\/p>\r\n\t<p>Bright and breezy, this hotel is a grown-up playground of side-by-side swings over the turquoise sea, DJs playing at the East Bar and clandestine late-night dancing spots. By day, you won&#8217;t see sharper bikinis or larger sunglasses anywhere else in the atolls. When you&#8217;re on a speck in the middle of the Indian Ocean for a week, it&#8217;s good to keep things feeling fun and spontaneous. One night you might sink into a bean bag to watch a film at the pop-up outdoor cinema, the next skip off to the spa for a bespoke LUX* Me treatment. And on the third you could discover an astrologist on the beach, ready to help with stargazing. The morning after, order room-service breakfast on your veranda, to enjoy with the splendid sea view or served on a floating tray in your private swimming pool. None of this is done without a conscience though &#8211; the green credentials here are meaningful, with cooking oil turned into biofuel and gardens irrigated by bath water, plus chemical-free cleaning products and filtered bottled water. Impressive.<\/p>\r\n<\/div><!-- .vgblk-rw-wrapper -->","protected":false},"excerpt":{"rendered":"<p>Mauritius .fl-node- h2.vamtam-heading * { color: #ffa28a !important; } With its sugar-cane plantations, Hindu temples, coral reefs and searing Creole cooking, Mauritius is a thrillingly exotic winter hop. The three-hour time-difference and an overnight flight means minimal jet lag too. No wonder everyone goes so crazy for it. LUX* Le Morne comes with a correspondingly&#8230;<\/p>\n","protected":false},"author":2,"featured_media":15054,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_price":"","_stock":"","_tribe_ticket_header":"","_tribe_default_ticket_provider":"","_tribe_ticket_capacity":"0","_ticket_start_date":"","_ticket_end_date":"","_tribe_ticket_show_description":"","_tribe_ticket_show_not_going":false,"_tribe_ticket_use_global_stock":"","_tribe_ticket_global_stock_level":"","_global_stock_mode":"","_global_stock_cap":"","_tribe_rsvp_for_event":"","_tribe_ticket_going_count":"","_tribe_ticket_not_going_count":"","_tribe_tickets_list":[],"_tribe_ticket_has_attendee_info_fields":false},"categories":[530,17],"tags":[514,512,513],"jetpack_featured_media_url":"https:\/\/pur.vamtam.com\/wp-content\/uploads\/2017\/11\/gallery-5.jpg","jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/posts\/6748"}],"collection":[{"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/comments?post=6748"}],"version-history":[{"count":11,"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/posts\/6748\/revisions"}],"predecessor-version":[{"id":16887,"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/posts\/6748\/revisions\/16887"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/media\/15054"}],"wp:attachment":[{"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/media?parent=6748"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/categories?post=6748"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/pur.vamtam.com\/wp-json\/wp\/v2\/tags?post=6748"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}